---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationVendorCode
source: html/f6534184-3fd1-a2fb-62e7-748c356abef0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationVendorCode Property

"Vendor Code"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationVendorCode { get; }
```